_posts/2016-11-19-coders-at-work.html
---
layout: post
title: Coders at work
excerpt: Experiences of great programmers are enlightening
---

<p>
I've recently been reading Peter Seibel's <a href="http://www.apress.com/us/book/9781430219484">Coders at Work</a>, a collection of interviews with some of the best programmers alive today. Having enjoyed Seibel's <a href="http://www.gigamonkeys.com/book/">Practical Common Lisp</a>, I had high expectations for his work, and was not disappointed.
</p>

<p>
<i>Coders at Work</i> is derived from hours of interviews with such luminaries as <a href="https://labs.oracle.com/pls/apex/f?p=labs:bio:0:120">Guy Steele</a>, <a href="http://joearms.github.io/">Joe Armstrong</a>, and <a href="https://www.microsoft.com/en-us/research/people/simonpj/">Simon Peyton Jones</a>. Throughout these interviews, Seibel digs into issues such as how these great programmers got started, what they think of the field today, and where they think software development is going. Some interviews are more historical; others, more technical. The book is clearly intended for programmers, but (as interviews are wont to) takes a conversational tone.
</p>

<p>
A few takeaways from these interviews:
</p>

<ul class="org-ul">
<li>Great programmers prefer to work alone
</li>
<li>Interest and dedication are more important than technical skill
</li>
<li>Industry tackles harder problems than academia, but has less leeway to pursue elegant solutions
</li>
<li>There's something of a split between those who want to get software up and running as quickly as possible and those who want to plan everything out
</li>
</ul>

<p>
I've yet to finish the book, having jumped immediately to the interviewees that most interested me, such as <a href="https://www.jwz.org/about.html">Jamie Zawinski</a> and <a href="http://norvig.com/">Peter Norvig</a>. The book is long&#x2013;over 600 pages&#x2013;but is deeply engaging. I can't wait to get back to it, and I recommend it to anyone who wants to know more about the field and the men<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> who defined it.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
All interviewees are indeed men
</p></div>


</div>
</div>
